app/controllers/auth_controller.rb

  def process_login
    user = User.where(username: params[:username]).first
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["username", ""]]