app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE (books.name LIKE '%1%' or books.page_count LIKE '%1%' or books.genre LIKE '%1%')  ORDER BY "books"."created_at" DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "books" WHERE (books.name LIKE '%a%' or books.page_count LIKE '%a%' or books.genre LIKE '%a%')
---
	def index
		@books = Book.all.desc
		@books = @books.paginate(:page => params[:page], :per_page => 5)

INSERT INTO "books" ("name", "genre", "page_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Dark night"], ["genre", "horror"], ["page_count", 150], ["created_at", "2016-11-10 22:48:14.638214"], ["updated_at", "2016-11-10 22:48:14.638214"]]
---
	def create
		@book = Book.new(book_params)

		if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 2]]
---
	def destroy
		@book = Book.find(params[:id])

		if @book.destroy