app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "msruseva"], ["password", "1234"], ["created_at", "2016-11-10 22:36:05.796907"], ["updated_at", "2016-11-10 22:36:05.796907"]]